status/2022/0930.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-01 Sat 06:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>24 September 2022 - 30 September 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">24 September 2022 - 30 September 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org92e0f9b">1. MIT OCW</a>
<ul>
<li><a href="#orga8b45e9">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#orgf54b335">1.1.1. Session 95-92,PSet2</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org607fa8b">2. Emergency Crystal Radio</a>
<ul>
<li><a href="#org23ec130">2.1. Need good ground straps</a></li>
</ul>
</li>
<li><a href="#orgf6284e9">3. Mill Controller #2</a>
<ul>
<li><a href="#orgab59298">3.1. Repurpose 'boss' hard drive</a></li>
<li><a href="#org14fdf14">3.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#orgaf73ade">3.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#orgf3e7d8a">3.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org133f8cf">4. Alum Rock Data Center</a>
<ul>
<li><a href="#org0187b32">4.1. Using CentOS 7 for now - good until 2024?</a></li>
<li><a href="#orge6f7640">4.2. need to check alma, rocky, others? for suitability</a></li>
</ul>
</li>
<li><a href="#orga1e1c9c">5. OLPC</a>
<ul>
<li><a href="#orgd7094f1">5.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#orgfb14f87">6. Virtual Orchestra</a>
<ul>
<li><a href="#org0b80b16">6.1. sfz file tests</a>
<ul>
<li><a href="#org9ffe231">6.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#org784ccf0">6.2. increasingly skeptical whether quality results are possible</a></li>
</ul>
</li>
<li><a href="#org79e37f1">7. gat</a>
<ul>
<li><a href="#org29da357">7.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#org7922fd6">8. abby</a>
<ul>
<li><a href="#org437ecdf">8.1. installed 4 wire chassis fan</a></li>
</ul>
</li>
<li><a href="#org25f1319">9. marble computing</a>
<ul>
<li><a href="#orge181731">9.1. Programmable Marble Gate Array</a>
<ul>
<li><a href="#org421e417">9.1.1. Servo interface tested</a></li>
<li><a href="#orgee6d9b3">9.1.2. Gate plate designed</a></li>
<li><a href="#org281fec8">9.1.3. Gate ball sensor needs to be revisited</a></li>
<li><a href="#orgba39973">9.1.4. Gate controller in design</a></li>
<li><a href="#org4223f13">9.1.5. Planning display integration</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9f65c2e">10. small graphics display</a>
<ul>
<li><a href="#org8510b99">10.1. Use 320x480 OLED display and ESP8266+WiFi</a></li>
<li><a href="#org67a1d5d">10.2. BWIF (Barely Working Image Format) designed</a></li>
<li><a href="#org96fb899">10.3. pamtobwif/bwiftopam mostly complete</a></li>
<li><a href="#orgcd6d71b">10.4. VT340+Regis graphics (Abandoned)</a></li>
</ul>
</li>
<li><a href="#org3d3dc8c">11. mcd05 32 button/led box</a>
<ul>
<li><a href="#org144edde">11.1. Recovered schematics.</a></li>
<li><a href="#orgc6cf93b">11.2. Planning software.</a></li>
</ul>
</li>
<li><a href="#orgbfbf8f5">12. More project ideas</a>
<ul>
<li><a href="#org227379d">12.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#org09e1ee1">12.2. GMPForth ports to SIMH</a>
<ul>
<li><a href="#org8fba5c3">12.2.1. SIMH maybe some targets (vax)</a></li>
<li><a href="#org70f953c">12.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#orgfa2d766">12.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#org8c6beff">12.3. GMPASM assembler</a></li>
<li><a href="#orgc68ba8b">12.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#org3a6b379">12.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#orgfb22296">12.5.1. Offline compilation</a></li>
<li><a href="#org1dd94b6">12.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#org5226371">12.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#org9a38e0a">12.6.1. RTX2000, CDP1802 still available!</a></li>
<li><a href="#org09859df">12.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#org73e4052">12.6.3. CPUs with async bus may be supportable without RAM</a></li>
<li><a href="#orgdfa1b3d">12.6.4. Use Nucleo w/ 5V tolerant IO as boot loader controller</a></li>
</ul>
</li>
<li><a href="#orgc779c84">12.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#orgc3d58e9">12.7.1. OSI Superboard</a></li>
<li><a href="#org0f8520d">12.7.2. Super Jolt</a></li>
<li><a href="#org7b00fde">12.7.3. Ampro Little Board</a></li>
<li><a href="#orgf652fe1">12.7.4. Rockwell R65F11 Demo board</a></li>
<li><a href="#orgb1bd3b6">12.7.5. NMIX-0016</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9dc8b23">13. David Davies</a>
<ul>
<li><a href="#orgf4e3c16">13.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#orgdac5d3f">13.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#orgcd99387">13.3. Next hearing 10/20/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org92e0f9b" class="outline-2">
<h2 id="org92e0f9b"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga8b45e9" class="outline-3">
<h3 id="orga8b45e9"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgf54b335" class="outline-4">
<h4 id="orgf54b335"><span class="section-number-4">1.1.1.</span> Session 95-92,PSet2</h4>
</div>
</div>
</div>
<div id="outline-container-org607fa8b" class="outline-2">
<h2 id="org607fa8b"><span class="section-number-2">2.</span> Emergency Crystal Radio</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org23ec130" class="outline-3">
<h3 id="org23ec130"><span class="section-number-3">2.1.</span> Need good ground straps</h3>
</div>
</div>
<div id="outline-container-orgf6284e9" class="outline-2">
<h2 id="orgf6284e9"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgab59298" class="outline-3">
<h3 id="orgab59298"><span class="section-number-3">3.1.</span> Repurpose 'boss' hard drive</h3>
</div>
<div id="outline-container-org14fdf14" class="outline-3">
<h3 id="org14fdf14"><span class="section-number-3">3.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgaf73ade" class="outline-4">
<h4 id="orgaf73ade"><span class="section-number-4">3.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-orgf3e7d8a" class="outline-4">
<h4 id="orgf3e7d8a"><span class="section-number-4">3.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org133f8cf" class="outline-2">
<h2 id="org133f8cf"><span class="section-number-2">4.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org0187b32" class="outline-3">
<h3 id="org0187b32"><span class="section-number-3">4.1.</span> Using CentOS 7 for now - good until 2024?</h3>
</div>
<div id="outline-container-orge6f7640" class="outline-3">
<h3 id="orge6f7640"><span class="section-number-3">4.2.</span> need to check alma, rocky, others? for suitability</h3>
</div>
</div>
<div id="outline-container-orga1e1c9c" class="outline-2">
<h2 id="orga1e1c9c"><span class="section-number-2">5.</span> OLPC</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd7094f1" class="outline-3">
<h3 id="orgd7094f1"><span class="section-number-3">5.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-orgfb14f87" class="outline-2">
<h2 id="orgfb14f87"><span class="section-number-2">6.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org0b80b16" class="outline-3">
<h3 id="org0b80b16"><span class="section-number-3">6.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org9ffe231" class="outline-4">
<h4 id="org9ffe231"><span class="section-number-4">6.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
<div id="outline-container-org784ccf0" class="outline-3">
<h3 id="org784ccf0"><span class="section-number-3">6.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
</div>
<div id="outline-container-org79e37f1" class="outline-2">
<h2 id="org79e37f1"><span class="section-number-2">7.</span> gat</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org29da357" class="outline-3">
<h3 id="org29da357"><span class="section-number-3">7.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-org7922fd6" class="outline-2">
<h2 id="org7922fd6"><span class="section-number-2">8.</span> abby</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org437ecdf" class="outline-3">
<h3 id="org437ecdf"><span class="section-number-3">8.1.</span> installed 4 wire chassis fan</h3>
<div class="outline-text-3" id="text-8-1">
<p>
now quiet again
</p>
</div>
</div>
</div>
<div id="outline-container-org25f1319" class="outline-2">
<h2 id="org25f1319"><span class="section-number-2">9.</span> marble computing</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orge181731" class="outline-3">
<h3 id="orge181731"><span class="section-number-3">9.1.</span> Programmable Marble Gate Array</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org421e417" class="outline-4">
<h4 id="org421e417"><span class="section-number-4">9.1.1.</span> Servo interface tested</h4>
</div>
<div id="outline-container-orgee6d9b3" class="outline-4">
<h4 id="orgee6d9b3"><span class="section-number-4">9.1.2.</span> Gate plate designed</h4>
<div class="outline-text-4" id="text-9-1-2">
<p>
Needs fabrication
</p>
</div>
</div>
<div id="outline-container-org281fec8" class="outline-4">
<h4 id="org281fec8"><span class="section-number-4">9.1.3.</span> Gate ball sensor needs to be revisited</h4>
<div class="outline-text-4" id="text-9-1-3">
</div>
<ol class="org-ol">
<li><a id="org5453648"></a>Original approach (ball shorting rails) unreliable.<br /></li>
<li><a id="org624831d"></a>Investigating phototransistor approach<br /></li>
</ol>
</div>
<div id="outline-container-orgba39973" class="outline-4">
<h4 id="orgba39973"><span class="section-number-4">9.1.4.</span> Gate controller in design</h4>
</div>
<div id="outline-container-org4223f13" class="outline-4">
<h4 id="org4223f13"><span class="section-number-4">9.1.5.</span> Planning display integration</h4>
</div>
</div>
</div>
<div id="outline-container-org9f65c2e" class="outline-2">
<h2 id="org9f65c2e"><span class="section-number-2">10.</span> small graphics display</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org8510b99" class="outline-3">
<h3 id="org8510b99"><span class="section-number-3">10.1.</span> Use 320x480 OLED display and ESP8266+WiFi</h3>
</div>
<div id="outline-container-org67a1d5d" class="outline-3">
<h3 id="org67a1d5d"><span class="section-number-3">10.2.</span> BWIF (Barely Working Image Format) designed</h3>
</div>
<div id="outline-container-org96fb899" class="outline-3">
<h3 id="org96fb899"><span class="section-number-3">10.3.</span> pamtobwif/bwiftopam mostly complete</h3>
</div>
<div id="outline-container-orgcd6d71b" class="outline-3">
<h3 id="orgcd6d71b"><span class="section-number-3">10.4.</span> VT340+Regis graphics (Abandoned)</h3>
<div class="outline-text-3" id="text-10-4">
<p>
OLED display cannot hardware scroll in required direction
</p>
</div>
</div>
</div>
<div id="outline-container-org3d3dc8c" class="outline-2">
<h2 id="org3d3dc8c"><span class="section-number-2">11.</span> mcd05 32 button/led box</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org144edde" class="outline-3">
<h3 id="org144edde"><span class="section-number-3">11.1.</span> Recovered schematics.</h3>
</div>
<div id="outline-container-orgc6cf93b" class="outline-3">
<h3 id="orgc6cf93b"><span class="section-number-3">11.2.</span> Planning software.</h3>
</div>
</div>
<div id="outline-container-orgbfbf8f5" class="outline-2">
<h2 id="orgbfbf8f5"><span class="section-number-2">12.</span> More project ideas</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org227379d" class="outline-3">
<h3 id="org227379d"><span class="section-number-3">12.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-12-1">
<p>
Good excuse for floating point ALU design.
</p>
</div>
</div>
<div id="outline-container-org09e1ee1" class="outline-3">
<h3 id="org09e1ee1"><span class="section-number-3">12.2.</span> GMPForth ports to SIMH</h3>
<div class="outline-text-3" id="text-12-2">
</div>
<div id="outline-container-org8fba5c3" class="outline-4">
<h4 id="org8fba5c3"><span class="section-number-4">12.2.1.</span> SIMH maybe some targets (vax)</h4>
</div>
<div id="outline-container-org70f953c" class="outline-4">
<h4 id="org70f953c"><span class="section-number-4">12.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-12-2-2">
<p>
How to support erzatz systems?
</p>
</div>
</div>
<div id="outline-container-orgfa2d766" class="outline-4">
<h4 id="orgfa2d766"><span class="section-number-4">12.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-org8c6beff" class="outline-3">
<h3 id="org8c6beff"><span class="section-number-3">12.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-12-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-orgc68ba8b" class="outline-3">
<h3 id="orgc68ba8b"><span class="section-number-3">12.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-org3a6b379" class="outline-3">
<h3 id="org3a6b379"><span class="section-number-3">12.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-12-5">
</div>
<div id="outline-container-orgfb22296" class="outline-4">
<h4 id="orgfb22296"><span class="section-number-4">12.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-org1dd94b6" class="outline-4">
<h4 id="org1dd94b6"><span class="section-number-4">12.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-org5226371" class="outline-3">
<h3 id="org5226371"><span class="section-number-3">12.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-12-6">
</div>
<div id="outline-container-org9a38e0a" class="outline-4">
<h4 id="org9a38e0a"><span class="section-number-4">12.6.1.</span> RTX2000, CDP1802 still available!</h4>
</div>
<div id="outline-container-org09859df" class="outline-4">
<h4 id="org09859df"><span class="section-number-4">12.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-org73e4052" class="outline-4">
<h4 id="org73e4052"><span class="section-number-4">12.6.3.</span> CPUs with async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-orgdfa1b3d" class="outline-4">
<h4 id="orgdfa1b3d"><span class="section-number-4">12.6.4.</span> Use Nucleo w/ 5V tolerant IO as boot loader controller</h4>
</div>
</div>
<div id="outline-container-orgc779c84" class="outline-3">
<h3 id="orgc779c84"><span class="section-number-3">12.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-12-7">
</div>
<div id="outline-container-orgc3d58e9" class="outline-4">
<h4 id="orgc3d58e9"><span class="section-number-4">12.7.1.</span> OSI Superboard</h4>
<div class="outline-text-4" id="text-12-7-1">
<p>
Unknown. Ordered composite to VGA adapter.
</p>
</div>
</div>
<div id="outline-container-org0f8520d" class="outline-4">
<h4 id="org0f8520d"><span class="section-number-4">12.7.2.</span> Super Jolt</h4>
<div class="outline-text-4" id="text-12-7-2">
<p>
No output. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org7b00fde" class="outline-4">
<h4 id="org7b00fde"><span class="section-number-4">12.7.3.</span> Ampro Little Board</h4>
<div class="outline-text-4" id="text-12-7-3">
<p>
Not booting. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-orgf652fe1" class="outline-4">
<h4 id="orgf652fe1"><span class="section-number-4">12.7.4.</span> Rockwell R65F11 Demo board</h4>
<div class="outline-text-4" id="text-12-7-4">
<p>
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
</p>
</div>
</div>
<div id="outline-container-orgb1bd3b6" class="outline-4">
<h4 id="orgb1bd3b6"><span class="section-number-4">12.7.5.</span> NMIX-0016</h4>
<div class="outline-text-4" id="text-12-7-5">
<p>
Works.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org9dc8b23" class="outline-2">
<h2 id="org9dc8b23"><span class="section-number-2">13.</span> David Davies</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgf4e3c16" class="outline-3">
<h3 id="orgf4e3c16"><span class="section-number-3">13.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orgdac5d3f" class="outline-3">
<h3 id="orgdac5d3f"><span class="section-number-3">13.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-orgcd99387" class="outline-3">
<h3 id="orgcd99387"><span class="section-number-3">13.3.</span> Next hearing 10/20/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2022-10-01 Sat 06:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
